export const HiteshSirLiveTranscript = `
आप लोगों ने बहुत सारे रोड मैप देखे होंगे जहां पे यह बताते हैं कि आपको क्या करना चाहिए कैसे डाटा साइंटिस्ट बने कैसे वेब 
डेवलपर बने कैसे जॉब इंटरव्यू क्रैक करें डीएसए से लेकिन इस वीडियो के अंदर मैं आपको बताऊंगा क्या नहीं करना है यह रोड 
मैप टोटली इस बात पे है कि आपको क्या-क्या नहीं करना चाहिए डेवलपमेंट सीखते टाइम थोड़ा सा अनोखा है बट बहुत ही अच्छा
वीडियो है हां जी कैसे हैं आप सभी स्वागत है आप सभी का चाय और कोड में हमारे youtube1 के से 200 के के बीच में और इस
वीडियो का टारगेट है 555 कमेंट्स हां जी एगजैक्टली और मुझे यह बता दीजिएगा कि जब आप वीडियो देख रहे हैं तब हमारा सब्सक्राइबर 
काउंट क्या चल रहा है ताकि पता रहे कि लोग बाग जब आ रहे हैं इस वीडियो पे तब हमारी जर्नी कहां तक पहुंच गई है तो चलिए शुरू करते हैं यह
वाला वीडियो जो है थोड़ा सा स्पेशल है हमारा इस वीडियो के अंदर मैं आपको एक छोटी सी कहानी सुनाऊंगा रोड मैप की जो कि शुभम फॉलो कर रहे 
हैं अब शुभम क्या है कि बड़ी इंटरेस्टिंग कैरेक्टर हैं और आपको इनके बारे में जानना चाहिए ताकि आप इन जैसा काम ना कर पाए है तो शुभम जो 
है हमारे सेकंड ईयर के स्टूडेंट हैं शुभम क्या है कि किसी आईआईटी एनआईटी से तो है नहीं तो फर्स्ट ईयर का तो पूरा का पूरा उनका पूरा जो 
ईयर है वो इसी बात में चला गया कि यार मेरा आईआईटी में नहीं हो पाया पता है मैं बस इतने से नंबर से आईआईटी में रह गया क्या एक दोबारा
अटेंप्ट कर लूं क्या या फिर इसी कॉलेज में रह लेता हूं और फर्स्ट ईयर तो यह सोचने में यह कहानी बताने में ही चला गया और सेकंड ईयर में
आते ही शुभम ने अपना इंट्रोडक्शन स्टार्ट कर दिया है शुभम का इंट्रोडक्शन ऐसे स्टार्ट होता है कि मेरा नाम शुभम है मैं टियर थ्री कॉलेज 
से हूं जितना लोग आईआईटी एनआईटी के बारे में ब्रैग नहीं करते हैं उससे ज्यादा शुभम अपना विक्टिम कार्ड खेलते हैं हमेशा कि मैं टियर थ 
कॉलेज से हूं अब देखिए एक बात तो तय है इंडिया के अंदर हाथ पे गिनने लायक आईआईटी और एनआईटी हैं इन आईआईटी एनआईटी को छोड़ दें तो इसके 
बाद सारे कॉलेज को ही लोग टियर थ्री में काउंट करते हैं कुछ अच्छे इंजीनियरिंग प्राइवेट कॉलेज हैं जिनके भर के आपको रिव्यूज मिल जाएंगे 
पता नहीं कैसे लोग रिव्यूज कर देते हैं कॉलेज का भी इनप भी कभी चर्चा करेंगे फुर्सत में बट आईआईटी और एनआईटी को छोड़ दें तो उसके अलावा 
सभी कॉलेजेस इस को टियर थ्री में ही काउंट करते हैं और हमेशा सबको एक ही लगता है कि पहले तो कंपनी आती थी अब नहीं आती है पहले तो बहुत 
जॉब होती थी अब नहीं होती है मार्केट पहले बहुत अच्छा था अभी रिसेशन में है जब मैंने इंजीनियरिंग करी इतने साल पहले तब भी मार्केट 
रिसेशन में था आज भी मार्केट रिसेशन में है तब भी बहुत ज्यादा डिमांड थी अच्छे स्किल्ड इंजीनियर्स की आज भी बहुत डिमांड है तो यह कहानी 
तो हमेशा ही चलती है लेकिन शुभम का इंट्रोडक्शन अब स्टार्ट ही ऐसे होता है जब भी पूछते हैं शुभम क्या करते हो शुभम मैं मेरा नाम शुभम 
है मैं टियर थ्री कॉलेज से हूं तो शुभम सबसे पहले अपना विक्टिम का आरडीआई खेलते हैं अब शुभम को लगा यार कुछ करना तो पड़ेगा और ऑफ कैंपस 
और आजकल रिमोट जॉब्स ओपन सोर्स यह सब बहुत ज्यादा पॉपुलर है तो मैं क्या करता हूं कि डीएसए वगैरह तो बाद में सीख लेंगे इसपे रोड मैप 
कभी और लाएंगे अभी मैं एक डेवलपमेंट शुरू कर लेता हूं अब शुभम को लगता है कि डेवलपमेंट का मतलब सिर्फ वेब डेवलपमेंट ही होता है तो शुभम 
जी निकल गए हैं डेवलपमेंट सीखने अब शुभम जी को ये नहीं पता कि सॉफ्टवेयर डेवलपमेंट अपने आप में एक स्किल है ये सिर्फ वेब डेवलपमेंट 
नहीं है ये ऐप डेवलपमेंट भी है सॉफ्टवेयर डेवलपमेंट भी है बैक एंड डेवलपमेंट भी है डेस्कटॉप पप भी डेवलपमेंट तो डेवलपमेंट है बट बट ठीक 
है शुभम जी को लगता है कि इसी तरह से काम होता है तो शुभम ने देखा एक बढ़िया सा रोड मैप और शुरू कर दिया अपनी जर्नी अब शुभम को लगा 
सबसे पहले हम स्टार्ट करते हैं अपने बेसिक फ्रंट एंड डेवलपमेंट से क्योंकि वही तो सबसे इजी है तो शुभम ने स्टार्ट करा एचटीएमएल और उसके 
बाद पढ़ने लग गए सीएसएस उसके बाद थोड़ी सी जावास्क्रिप्ट पढ़ी और उसके बाद याद आया कि यार जावास्क्रिप्ट से पहले तो मुझे और सीएसएस के 
फ्रेमवर्क करने चाहिए तो शुभम ने स्टार्ट कर दिया कि किसी से पूछा कि यार बूट स्ट्रैप तो सबसे अच्छा फ्रेमवर्क है ये तो आना ही चाहिए 
शुभम ने थोड़ा सा बूट स्ट्रैप पढ़ा और उसके बाद ने एक वीडियो देखा जहां कहा कि नहीं बूट स्टप तो पुराना हो गया अभी तो मटेरियल डिजाइन 
वगैरह पे काम करते हैं तो शिवम ने सोचा ये छोड़ते हैं थोड़ा सा मटेरियल का एक क्रैश कोर्स देख लेते हैं जैसे ही यह देख रहे थे तो पता 
लगा कि मार्केट में तो नई टर्म आ गई है टेल विंड सीएसएस तो अब टेल विंड पढ़ना पड़ेगा शुभम ने एक क्रैश कोर्स टेल विंड का देखा और सोचा 
कि ठीक है अभी टेल विंड हो गया है और जावास्क्रिप्ट तो मेरा हाफ हो ही गया था चलिए रिएक्ट ही पढ़ लेते हैं बाकी जावास्क्रिप्ट पढ़ के 
क्या ही करेंगे थोड़े से जावास्क्रिप्ट के बेसिक्स देखे और रिएक्ट में कूद पड़े रिएक्ट के कुछ क्रैश कोर्सेस देखे और दो-तीन एप्स बनाई 
और सोचा यार ये तो बहुत आसान है इसमें तो सारा काम फटाफट हो जाता है और इतने कोई खास जावास्क्रिप्ट के बेसिक्स की जरूरत भी नहीं है बट 
जैसे ही रिएक्ट के अंदर थोड़ा सा कर रहे थे सोचा यार रिएक्ट तो अभी सब कर रहे हैं तो मार्केट में कुछ अलग करना पड़ेगा अब शुभम जी को यह 
कौन समझाए कि मार्केट में जो सब कर रहे हैं इसका मतलब उसकी डिमांड होगी इसीलिए सब कर रहे हैं बट कुछ जो चीजें हैं जिसकी कम डिमांड है 
तो ओबवियस सी बात है कम लोग कर रहे हैं यह कांसेप्ट साइड में रख के शुभम जी ने कहा नहीं मुझे तो व्यू जेएस पढ़ना है तो शुभम जी ने 
निकाला youtube3 एस देखना इतने में पता ल लगा कि व्यू तो पुराना हो गया अभी तो स्वेल्ट किट आ गया है तो शुभम जी ने स्वेल्ट किट देखना 
शुरू कर दिया और शुभम जी को लगा कि यार व ये सब भी पढ़ लिया स्वेल्ट किट भी पड़ गया है क्या मैं अब फ्रंट एंड इंजीनियर बन गया हूं 
थोड़ा-थोड़ा तो बन ही गया हूं शुभम जी ने एक दो वीडियोस देखे हो सकता है कुछ सीनियर से बात करी तो पता लगा नहीं एंगुलर पढ़ना पड़ेगा 
नहीं नहीं वेब पैक पढ़ना पड़ेगा क्योंकि सारा काम तो वेब पैक से ही होता है और शुभम जी इनको भी पढ़ने निकल गए थोड़ा बहुत कुछ आईडिया 
लिया उतने में लगा कि यार ये सब तो नहीं हो पा रहा चलिए बैक एंड ट्राई कर लेते हैं अब बैक एंड जैसे ही पढ़ने निकले तो सबसे पहले पता 
लगा यार नट जए का बैक एंड जो है ना मर्न स्टैक या मीन स्टैक ये आजकल बहुत पॉपुलर है तो चलो नट जए पे चलते हैं फिर पता लगा नहीं मार्केट 
में हमारे आसपास जो डिमांड है अभी भी पीएचपी की थोड़ी बहुत है शायद पीएचपी पढ़ लेते हैं पीएचपी के साथ एक दो दिन बिताए और शुभम जी को 
लगा नहीं नहीं पीएचपी से तो नहीं हो रहा अपना काम रूबी ऑन रेल्स पे चलते हैं नहीं नहीं इसमें भी मजा नहीं आ रहा एक काम करते हैं जंगो 
पे चलते हैं पाइथन वैसे इतनी पॉपुलर है हो सकता है आगे जाके मैं डाटा साइंस भी पढ़ लूं तो जंगो पढ़ लेता हूं और अपना फिर शुभम ने एक 
छोटा सा वीडियो देखा जहां कहा कि इंडस्ट्री तो जावा यूज करती है जावा और स्प्रिंग बूट सीखो शुभम जी निकल गए कोर्स परचेस करने के लिए और 
उन्होंने जावा स्प्रिंग बूट सीखना शुरू कर दिया थोड़ा सा पढ़ा और फिर लगा यार ये जावा तो थोड़ी कॉम्प्लिकेटेड है शायद मुझे आती ही नहीं 
है चलिए जावा दोबारा से शुरू करते हैं तीन-चार दिन जावा को भी दिए शुभम जी ने फिर शुभम जी को लगा कि शायद मुझे बैक एंड इसलिए नहीं आ 
रहा है क्योंकि मेरा डेटाबेस स्ट्रांग नहीं है चलिए डेटाबेस पढ़ने निकलते हैं तो शुभम जी को सबसे पहले मिला माय सीक्वल बोला कि ये तो 
आना ही चाहिए अभी आप डेटा साइंस में जाओगे चाहे आप वेब डेवलपमेंट में जाओगे माय सीक्वल तो सबको आना ही चाहिए तो शुभम जी निकल गए माय 
सीक्वल पढ़ने माय सीक्वल पढ़ते ही कहा कि अरे आजकल माय सीक्वल से ज्यादा पोस्टग्रेस यूज होता है पोस्टग्रेस पढ़ो या फिर एमएस एसक्यूएल 
पढ़ो तो शुभम जी ने सोचा कि चलिए पोस्टग्रेस पढ़ के देखते हैं थोड़े दिन पोस्टग्रेस पढ़ा एक नया वीडियो आ गया जिसमें कहा कि व्हाई माय 
सीक्वल इज नो लंगर ए गुड डेटाबेस वी नीड टू स्विच इन टू नो सीक्वल डेटाबेस शुभम जी ने थोड़ी सी चैट जीपीटी से रिसर्च करी और निकल गए नो 
सीक्वल डेटाबेस पढ़ने स्टार्ट ऑफकोर्स सी बात है मंगो डीबी से किया थोड़ा सा पढ़ा भी कुछ समझ में भी आया उसके बाद उनको पता लगा एक 
आर्टिकल में कि मंगो डीबी स्केल नहीं करता है इसलिए हम केंड्रा पढ़ेंगे तो व केंड्रा पढ़ने निकल गए जैसे उन्होंने केंड्रा पढ़ा उनके 
सामने एक और नया डेटाबेस आ गया कि सर्चिंग भी तो जरूरी है तो इलास्टिक सर्च हमें ज्यादा पढ़ना चाहिए क्योंकि एक एप्लीकेशन में अगर सर्च 
ही नहीं हो रहा है कुछ तो किस काम की है तो वो इलास्टिक सर्च पढ़ने निकल गए उसके बाद कुछ लेटेस्ट अपडेट स्क्रॉल कर ही रहे थे डेटाबेस आ 
गए हैं अभी तो हमें यो 4g पढ़ना चाहिए तो शिवम जी निकल गए कि चलिए इंट्रोडक्शन तो ले ही लेते हैं यो 4g का पर अब देखिए एक बड़ी लेवल की 
एप्लीकेशन बना रहे हैं तो क्यूंग सर्विस तो लगेगी ही लगेगी ना तो क्यूंग सर्विस तो पढ़ना जरूरी है अब आप आजचे काफ का हो एसक्यूएस हो रो 
एम क्य हो रैबिट एम क्यू हो ये सर्विसेस तो पढ़नी पड़ेगी ना मैसेजेस क्यू की तो ये तो पढ़ना जरूरी है थोड़ा सा पढ़ के देखा पता लगा यार 
ये थोड़ा एडवांस हो गया है थोड़ा सा पीछे चलते हैं अभी इतना तो नहीं हो पा रहा है इतना कर ही रहे थे कि अपने सेकंड ईयर तो निकल गया 
थर्ड ईयर में आते ही शुभम जी को लगा कि यार यह सब तो अपने बस का नहीं अपन एक काम करते हैं क्लाउड में और डेप्स में चलते हैं वहां पे 
आजकल रिमोट जॉब्स भी बहुत है पैकेजेस भी बहुत हाई है और रिमोट जॉब भी लगती है तो चलिए अब हम चलते हैं अपने डेप्स की कहानी की तरफ डेप्स 

पढ़ने निकले तो सबसे पहले उनको दिखाई दिया एनक्स क्या जो भी एप्लीकेशन बनाऊंगा कहीं तो होस्ट करनी पड़ेगी वेब सर्वर तो लगेगा एजन पढ़ने 
निकले ही थे कि समझ में आया कि एंजन से पहले मैं थोड़ा सा क्लाउड पढ़ लेता हूं वहां प्रोग्रामिंग की जरूरत नहीं होती निकले एडब्ल्यू 
पढ़ने एडब्ल्यू पढ़ते निकले और वहां पे एक हितेश का वीडियो उनको दिखा हे देयर एवरीवन हितेश हियर बैक अगेन विद अनदर वीडियो जिसने कहा कि 
आजकल जो मार्केट शेयर है अजोर का राइज हो रहा है तो उन्होंने कहा यार अब जीसीपी और एडब्ल्यू छोड़ते हैं अजोर पे फोकस करते हैं क्योंकि 
अजोर राइज हो रहा है क्योंकि हितेश ने एक वीडियो बनाया कि अजोर राइज हो रहा है निकल गए अजोर पढ़ने कि सोचा कि सर्टिफिकेशन करते हैं 
अजोर में थोड़ा सा पढ़ा थोड़ा समझ में आया थोड़ा नहीं आया बेसिक बेसिक ओवरव्यू आ गया उसके बाद सोचा यार किसी और डायरेक्शन में चलते हैं 
यह शायद इतना हो नहीं पा रहा से तो सोचा ऑटोमेशन की तरफ चलते हैं अब ऑटोमेशन में चले तो सबसे पहले मिला उनको आंबल आंबल सोचा यार ये तो 
पुरानी टेक हो गई है अभी तो शेफ पढ़ना पड़ेगा नहीं नहीं शेफ से भी अपना काम नहीं हो रहा है कुछ और लेटेस्ट चाहिए ऐसा लेटेस्ट जो 
इंडस्ट्री में यूज हो रहा है जेनकिंस पढ़ते हैं जेनकिंस आजकल मार्केट में है फिर किसी ने बताया अरे भाई यह सब नहीं होता है डेब्स में 
डेप्स में अगर आपको जाना है तो सबसे पहले डॉकर सीखो कुबर निटीज सीखो ये पूरा का पूरा वर्चुलाइजेशन कैसे होता है वीएम वेयर कैसे होता है 
यह सारा सीखना पड़ेगा तो शुभम जी निकल गए एक्सप्लोर करने के लिए ब्लेड सेंटर को वे ग्रेंट को और बहुत सारे नाम है मार्केट में प्लू मी हो गया सोचा यार यह सब सीखना पड़ेगा चलिए डेप्स में यहां ट्राई करते हैं फिर शुभम को थर्ड ईयर के एंड में आते-आते पता लगा कि यह सब 
नहीं मार्केट में डिमांड है ऐप डेवलपमेंट की अरे मैं तो गलत कर रहा था इतने दिन से ऐप डेवलपमेंट सीखना पड़ेगा अब ऐप डेवलपमेंट कैसे अरे 
इंडिया में मार्केट डिमांड जो है वो ए की है और ए कोर ए से बनाना ज्यादा अच्छा रहता है तो चलिए शुभम जी निकल गए अपने जावा सीखने फिर 
किसी ने बताया अरे जावा से फटाफट स्विच करके कटलिन में आ जाओ क्योंकि मार्केट में कटलिन ज्यादा बेटर लैंग्वेज है पुराना एक्सपीरियंस भी 
काम आएगा और आजकल इसमें बहुत हीट चल रहा है बहुत डिमांड है फिर शम को लगा यार android1 आईओ सीखना शुरू करा पता लगा ऑब्जेक्टिव सी से 
नहीं swift4 मार्केट से पता लगा कि आजकल कोर डेवलपमेंट कोर ऐ डेवलपमेंट तो डेड हो गया है आजकल क्रॉस प्लेटफॉर्म पप चलता है चम जी ने 
स्टार्ट करा एक सीरीज है मेरी रिएक्ट नेटिव की मेरे मेन youtube3 जी भी फ्लटर की बात कर रहे हैं मार्केट में फ्लटर की बहुत डिमांड है 
फ्लटर सीखना चाहिए रिएक्ट नेटिव पुराना हो चुका है अब कोई काम नहीं कर रहा उसपे आजकल मॉडर्न फ्लटर है चलिए फ्लटर पे चलते हैं अब जैसे 
ही फ्लटर पे काम करना शुरू करा तो पता लगा आयोनिक नाम की भी एक चीज है हां जी इससे भी एप्स बन जाती है तो आयोनिक सीखते हैं अब यह करते 
करते आ गया फाइनल ईयर अब आ गई बारी प्लेसमेंट की तो अब वीडियोस देखने शुरू हुए डीएसए के डीएसए लीड कोड से करें या फिर कोड फोर्सेस से करें डीएसए python2 कोड कुछ काम नहीं आता है डीएसए में सुडो कोड का कोई काम नहीं है आपको लैंग्वेज पे मास्टरी होनी चाहिए और सारे कंपटीशन c+ प् में होते हैं और फास्ट लैंग्वेज भी तो है तो सबसे पहले c+ प से डीएसए करो अब देखिए अ ये कहानी यह जो रोडमैप है ना यह 
ज्यादातर लोग फॉलो कर रहे हैं हो सकता है आपको थोड़ा एग्जिट लगा हो बट इससे दो फायदे हैं एक तो यह कि आपने बहुत सारी मार्केट की टर्म सीख ली यह भी अच्छी बात है क्योंकि नॉलेज थोड़ा सा इंप्रूव हो गया है और यह सबसे ज्यादा अडॉप्टेड रोडमैप है हां जी यह बात आप भी जानते 
हैं कमेंट सेक्शन में बताइएगा हालांकि अच्छे रोड मैप्स बहुत हैं मार्केट में जो आपको फ्रंट एंड भी सिखा दें बैक एंड भी सिखा दें अगर आप 
उनको फॉलो करें बट एक्चुअली में जो मार्केट में सबसे ज्यादा रोड मैप फॉलो हो रहा है वो यही वाला है हां जी हो सकता है इतना एजाज मेटली 
फॉलो ना हो मैंने थोड़ा सा एग्जिट कर दिया हो या शायद काफी कर दिया हो बट एक्चुअली मार्केट में यही वाला रोड मैप फॉलो हो रहा है और इसी 
के चलते जितने भी लोग ये शुभम वाला पाथ जो फॉलो कर रहे हैं ये अक्सर या तो विक्टिम कार्ड खेलते हैं कि हमारा टियर 3 कॉलेज है या फिर 
इनको थोड़ा-थोड़ा सब कुछ आता है अब थोड़ा-थोड़ा सब कुछ आने का मतलब ये नहीं होता है कि हम चीजों को बस एक्सप्लोर करके छोड़ दें 
थोड़ा-थोड़ा सब कुछ आने का मतलब है आपने उसमें काम करा है 5-10 प्रोजेक्ट्स बनाए हैं आपको उसका ठीक-ठाक इन डेप्थ आ गया है अब आपको किसी 
कारण से या फिर एक्सप्लोरेशन के चलते हुए आप दूसरा कोई सब्जेक्ट एक्सप्लोर कर रहे हैं दूसरा कोई फ्रेमवर्क गाइडलाइंस कुछ ना कुछ फॉलो 
कर रहे हैं यह जो रोडमैप है ना यह बहुत ही खराब रोड मैप है तो इस वीडियो की जो समरी है ना वो यही है कि यह वाला रोड मैप फॉलो नहीं करना 
है अच्छे रोड मैप्स और मैं भी चैनल पे लेके आता हूं बहुत सारे और मेरे फेलो youtube2 हैं वो भी लेके आते हैं तो प्लीज प्लीज रिक्वेस्ट 
है यह वाला रोड मैप तो मत ही फॉलो करना बस यही इस वीडियो के दो मोटिव थे मेरे कि आपको बहुत सारी टेक्नोलॉजीज के नाम से मैं इंट्रोड्यूस 
करा दूं ताकि एटलीस्ट आप क्यूरियोसिटी रहे आपको एक कैटेगरी मिल जाए कि कहां-कहां पे क्या-क्या काम होता है और दूसरी बात यह कि 
टेक्नोलॉजी बहुत वाइड है बहुत फस्ट है सब कुछ सीखना पॉसिबल नहीं है एक टाइम पे एक पोर्शन ही आपका मास्टर हो सकता है और उसको मास्टर 
करने में टाइम लगता है वक्त जाता है सब कुछ सीखने के चक्कर में कुछ नहीं आता है तो प्लीज हंबल रिक्वेस्ट है यह वाला रोड मैप ना फॉलो 
करें जिसको अधिकतर लोग फॉलो कर रहे हैं और दूसरी इंपॉर्टेंट बात यह विक्टिम कार्ड खेलना बंद कर दो कब तक ही यह ड्रामा करेंगे हम कि 
टियर थ कॉलेज से टीय थ कॉलेज से टियर थ के कॉलेज से हम भी हैं टियर थ के कॉलेज से बहुत सारे और भी लोग हैं जो तो आखिर कब तक ये विक्टिम 
कार्ड खेलेंगे हम ये टियर थ वाला कभी तो बंद करना पड़ेगा ना और काम करना पड़ेगा अपनी स्किल्स पे तो चलिए शुरू करते हैं अपनी स्किल्स पर 

काम करिए अच्छा लगा हो वीडियो तो सब्सक्राइब कर दीजिएगा और ज्यादा अच्छा लगा है तो शेयर कर दीजिएगा कमेंट का टारगेट पूरा कर दीजिएगा काफी काम दे दिए आपको कंप्लीट कर दीजिएगा चलिए मिलते हैं आपसे कभी और ऐसे ही एक एक और फन वीडियो में [संगीत] ब 
`;

export const PiyushSirLiveTranscript = `ऑलराइट सो वेलकम टू दी रोड मैप ऑफ चेन एआई डेवलपर 2025 सो इस पर्टिकुलर वीडियो के अंदर हम एक रोड मैप देखने वाले हैं दैट हाउ यू कैन बिकम अ जेन एआई डे
वलपर इन 2025 सो इस वीडियो के अंदर हम देखेंगे दैट कौन-कौन सी टेक्नोलॉजीज़ हैं क्या-क्या स्टेप्स हैं जो आपको एक सक्सेसफुल जेआई डेवलपर 
बना सकता है 2025 के अंदर बिकॉज़ यह एक बहुत ही एसेंशियल स्किल है राइट टुडे एव्री कंपनी एव्री सैस एव्री स्टार्टअप इज सम हाउ 
इंटीग्रेटिंग एआई इनू देयर एप्लीकेशनेशंस और जनरेटिव एआई एंड इनकी जो एआई ऑर्केस्टेशंस हैं उनके टूल्स एंड उनकी टेक्नोलॉजीस को 
अंडरस्टैंड करना एंड उनको सीखना इज़ अ वेरी एसेंशियल थिंग सो इस वीडियो के अंदर हम स्टेप बाय स्टेप बात करते हैं कि एक जेएनएआई डेवलपर 
के अंदर व्हाट ऑल थिंग्स यू शुड एक्सपेक्ट एंड क्या-क्या चीजें आपको सीखनी होंगी सो विथ दैट लेट्स स्टार्ट विद दी वीडियो ओके सो यहां 
पर मेरे पास एक रोड मैप है फॉर जेन एआई लेकिन उससे पहले मैं एक बहुत ही इंपॉर्टेंट चीज है जो आपके साथ डिस्कस करना चाहता हूं देखो डू 
नॉट कंफ्यूज मशीन लर्निंग विद जेन एआई ओके बात करते हैं इन चीजों के बारे में देखो आपने मशीन लर्निंग एक बहुत ही पुरानी चीज़ है जिसके 
बारे में आपने काफी सुना होगा मशीन लर्निंग कोर्सर्सेस मशीन लर्निंग रोड मैप्स एंड मशीन लर्निंग बहुत ही एक पुराना कोर्स है एंड इट इज़ 
अ वेरी एडवांस कोर्स एंड इसी के साथ इसी के साथ जो जेएनए है दिस इज़ रिलेटिवली वेरी न्यूअर इन दोनों के बीच का थोड़ा सा डिफरेंस जानना इज़ 
वेरीेंट ओके क्यों देखो जब आप मशीन लर्निंग की बात करते हो ना आप बात करते हो मैथ्स की ठीक है आपकी प्रीरिक्विज़िट्स जो होती है ना वो 
थोड़ी बल जाती हैं फॉर एग्जांपल आपको पाइथन अच्छे से आना चाहिए आपको मैथमेटिक्स आना चाहिए मैथमेटिक्स में यू शुड नो अबाउट स्टैटिस्टिक्स 
यू शुड नो अबाउट लीनियर अलजेब्रा यू शुड नो अबाउट ऑल दीज़ थिंग्स राइट उसके बाद इसमें आप ना डेटा के ऊपर प्ले करते हो फॉर एग्जांपल आप 
डेटा साइंटिस्ट वाला जो रोल है जो डेटा साइंटिस्ट वाली चीजें हैं वो ज्यादा परफॉर्म करते हो कि डेटा को कैसे मैनपुलेट कर सकते हैं राइट 
इसमें आप न्यूरल नेटवर्क्स के बारे में बात करते हो कि हाउ टू ट्रेन अ न्यूरल नेटवर्क हाउ टू बिल्ड अ न्यूरल नेटवर्क एंड इसमें जो आपकी 
लाइब्रेरीज़ होते हैं जो आप पाइथन लाइब्रेरीज़ यूज़ करते हो वो मोर साइंटिफिक होती हैं लाइक अ सकेट यूज़ करते हो राइट यू यूज़ नमपी यू यूज़ 
पंडाज़ यू यूज़ दीज़ काइंड ऑफ़ थिंग्स ओके तो दैट मींस ये वाला जो डोमेन है दैट इज़ ऑफ़ मशीन लर्निंग ये मोर फोकस्ड है हाउ टू ट्रेन ओके अ 
न्यूरल नेटवर्क ऑन टॉप ऑफ इट व्हाट इज अ न्यूरल नेटवर्क ठीक है सो ट्रेन अ न्यूरल नेटवर्क राइट एंड उसके बाद व्हाट इज़ अ न्यूरल नेटवर्क 
प्लस एलएलएम्स को ग्राउंड अप से कैसे बिल्ड करते हैं तो ये वाली जो फील्ड है ना दिस इज़ मोर ऑन दी रिसर्च साइड यहां पर एप्लीकेशन 
डेवलपमेंट नहीं होती है यहां पर होता है प्योर रिसर्च वर्क ऑन दी अदर हैंड जब हम जेन एआई की बात करते हैं यहां पर रिसर्च वर्क नहीं 
होता यहां पर होती है डेवलपमेंट डेवलपमेंट कैसे होती है व्हाटएवर मशीन लर्निंग इंजीनियर्स ने जो हमारे लिए एलएलएम्स बनाए हम उनको 
प्रोडक्शन पे कैसे यूज़ कर सकते हैं हम उनको एक रियल बिज़नेस यूज़ केस में कैसे फिट कर सकते हैं वो हमारे जेनएआई का स्कोप है सो फॉर 
एग्जांपल अगर एक मशीन लर्निंग इंजीनियर ने हमारे लिए एलएलएम बनाया लेट्स से जीपीटी देखो जीपीटी क्या है वो बेसिकली नेक्स्ट वर्ड 
प्रेडिक्शन पे काम करता है ठीक है आप उसको कुछ पूछो आपको आंसर मिलता है लेकिन लेट अस से मेरा खुद का एक साहस है लेट अस से मेरा एक टू 
डू एप्लीकेशन है राइट मुझे अपने यूज़ केस के अंदर उसको फिट करना है तो दैट इज़ द स्कोप ऑफ द जेनेi सो जब आप जेननेi की बात करते हो आप 
बेसिकली बात करते हो कि मैं एलएलएम्स को ठीक है एलएलएम मॉडल्स को एआई को खुद के इंफ्रास्ट्रक्चर में कैसे होस्ट करूं कैसे इंटीग्रेट 
करूं उसको मैं अपने खुद के जो भी अवेलेबल मेरे पास इंफ्रास्ट्रक्चर में लेट्स से मेरे पास डेटाबेस है मेरे पास यहां पर रेडिस है मैं 
कैसे ऑर्केस्ट्रेट करूं ऑर्केस्ट्रेशन वर्ड यहां पर बहुत इंपॉर्टेंट है कि मैं इस एलएलएम को कैसे अपने सिस्टम में फिट इन करूं कि यह 
कुछ एनएलपी या कुछ ऑटोमेटेड मैजिकल टास्क करने लगे सो दैट इज़ अ डिफरेंस सो लेट अस से अगर आपने एक बहुत ही एक कॉम्प्लेक्स सिस्टम डिज़ाइन 
कर रखा है राइट आपके पास यहां पर एक सिस्टम है ये एक सिस्टम है ये एक सिस्टम है और ये सारी माइक्रो सर्विसेस आपस में इंटरेक्ट कर रही 
हैं राइट एक टिपिकल जब आप एक बैक एंड आर्किटेक्ट करते हो तो दिस इज़ हाउ एवरीथिंग वर्क्स राइट इसके बीच में कहीं पर लेट अस से आप एक 
चार्ट जीपीटी आई मीन टू से ओपन एआई अगर आप चार्ट जीपीटी को बीच में प्लग इन करते हो राइट कि अब यहां पे कुछ मैजिकल एआई टास्क होगा दैट 
इज़ दी स्कोप ऑफ द जेन एआई ठीक है सो दिस इज़ अ डिफरेंस अब ये जेनएi बना कैसे वो मशीन लर्निंग एक्सपर्ट्स बता सकते हैं ओके सो दिस इज़ अ 
डिफरेंस बिटवीन मशीन लर्निंग एंड जेनए एंड हम इसमें बात कर रहे हैं जेन एआई की व्हिच इज़ मोर डेवलपर फोकस्ड अब वापस चलते हैं हमारे रोड 
मैप के ऊपर सो रोड मैप में जब आपको जेन एएआई के बारे में पढ़ना है फर्स्ट ऑफ़ ऑल यू शुड एक्चुअली नो दैट एक फाउंडेशन पे एक जेनए होता 
क्या है राइट कि जेनएआई क्या होता है एलएलएम्स क्या होते हैं रैक सिस्टम्स क्या होते हैं एंड जैसे ही आप इनको पढ़ना शुरू करोगे आपके 

पास ओपन एआई बहुत आएगा बिकॉज़ ऑब्वियसली उन्होंने स्टार्ट किया था उनकी एपीआई के बारे में आप पढ़ोगे हगिंग फेस के बारे में आप पढ़ोगे 
जीपीटी क्या होता है वो सब चीजें पढ़ोगे एंड आप ये कुछ टूल्स यूज़ करने वाले हो जुपिटर नोटबुक्स वीएस कोड पाइथन सेटअप एंड डोंट वरी आप 
टाइप स्क्रिप्ट में भी ये सब चीजें कर सकते हो बिकॉज़ ऐज़ अ डेवलपर यू डोंट हैव टू वरी अबाउट दी लैंग्वेज ओके फिर आप सबसे पहले अपना एक 
बहुत ही सिंपल सा चैटबॉट बनाओ कुछ नहीं है एक सिंपल सीएलआई चैटबॉट कैसे बनाना है ओपन एआई की जो चैट कंप्लीशंस है मतलब अब तो न्यू आ गई 
अब तो रिस्पांस एपीआई कंप्लीशंस आ गया है तो अभी रिस्पॉन्स एपीआई यूज़ कर सकते हो चैट कंप्लीशंस यूज़ कर सकते हो एंड आपको एक सिंपल सा 
चैट अ चैट बॉट बनाना है यहां पर आपको पता लगेगा कि एक सिस्टम प्र्प्ट क्या होता है ठीक है जब आप खुद का एक स्पेशल पर्पस चैट बॉल बनाते 
हो यू विल अंडरस्टैंड दैट व्हाई दी सिस्टम प्र्प्ट्स इज़ेंट एंड सिस्टम प्र्प्टिंग कैसे करते हैं जैसे ही आप सिस्टम प्र्टिंग के अंदर 
घुसोगे एक नया चैप्टर शुरू होगा दैट इज़ प्र्प्ट इंजीनियरिंग एंड टोकन मैनेजमेंट देखो सिर्फ और सिर्फ जब भी आप किसी एआई एप्लीकेशन को 
यूज़ करते हो आपकी कॉस्ट आती है एंड दैट कॉस्ट इज़ ट्रैक ऑन द टोकंस कितने टोकंस आपने इनपुट किए कितने टोकंस आपने आउटपुट करे तो जब आप 
प्र्प्ट इंजीनियरिंग करते हो एंड टोकन मैनेजमेंट करते हो यू कम टू नो कि अच्छा कितने तरह की प्र्टिंग्स हैं जीरो शॉट प्र्टिंग फ्यू 
शॉर्ट चेन ऑफ थॉट प्र्टिंग फिर आपको पता लगता है टेंपरेचर पैरामीटर कैसे है ठीक है टेंपरेचर पैरामीटर क्या करता है टॉप टोकंस क्या करते 
हैं मैक्स लेंथ क्या करते हैं तो ये सब चीजें ना बहुत इंपॉर्टेंट है टू गेट राइट आउटपुट फ्रॉम दी एलएलएम ओके अगर आपने कभी मशीन लर्निंग 
में किया होगा वहां पर एक लेयर होती है सॉफ्ट मैक्स लेयर तो वो टेंपरेचर के साथ कैसे कंबाइंड होती है कैसे लिड्ड होती है वो सब चीज़ आप 
यहां पढ़ोगे एंड फिर आप क्या कर सकते हो एक ईमेल जनरेटर बना सकते हो कि जो एक सब्जेक्ट एंड जनरेट एन ईमेल कॉपी सो यूज़ प्र्प टेंपल्लेट्स 
एंड रोल्स तो ये अगर आप एक छोटा सा ऐसा एक प्रोजेक्ट बनाते हो यू कम टू नो कि प्र्प्टिंग का क्याेंस है एलएलएम यूसेज के अंदर ओके तो 
जैसे ही आप ये वाला प्रोजेक्ट बनाना शुरू करोगे ना चीजें कॉम्प्लेक्स होना स्टार्ट हो जाती हैं आपका जो कोड स्ट्रक्चर है ना वो मेसी 
होना स्टार्ट हो जाता है एंड दैट इज़ वेयर यू फिगर आउट कि यार एक लंग चेन करके एक लाइब्रेरी है जिसके अंदर ना बहुत सारे टूल्स हैं 
यूटिलिटीज़ हैं कुछ नहीं है यूटिलिटी टूल्स हैं फॉर एग्जांपल चेंजिंग टूल्स हैं एजेंट टूल्स हैं मेमोरी के टूल्स हैं प्र्टिंग 
टेंप्लेट्स हैं उसके बाद आप एक क्या कर सकते हो एआई पावर पीडीएफ क्यू एंड ए बॉट बना सकते हो कि यूज़र्स ने कुछ आपको पीडीएफ दी एंड आप 
उसके ऊपर चैट कर सकते हो तो यहां पर सबसे पहली प्रॉब्लम क्या आती है कि यू एक्चुअली रन आउट ऑफ टोकंस बिकॉज़ कॉन्टेक्स्ट विंडो लिमिटेड 
है एंड अगर आप चंकिंग करते हो तो जैसे ही आप चंकिंग में घुसते हो यू एक्चुअली स्टार्ट लूजिंग कॉन्टेक्स्ट तो चंकिंग एंड टोकन मैनेजमेंट 
को आपस में कैसे बैलेंस करना है इनका इक्विलिब्रियम कैसे मेंटेन करना है तो यहां पर आप वो सारी चीजें सीखोगे बिकॉज़ आप ये प्रॉब्लम्स 
फेस करोगे फिर वेक्टर एंबेडिंग्स क्या होती है क्वेरिंग क्या होती है वो सब चीज़ आप यहां पे सीखोगे तो बेसिकली यहां पर आपका एक बहुत ही 
सिंपल सा एक रैग एप्लीकेशन बनना स्टार्ट होगा जिससे हमारा फज़ थ्री स्टार्ट होता है दैट इज़ रैक रैक क्या होता है रिट्रीवल ऑर्गुममेंटेड 
जनरेशंस ठीक है इसमें आप क्या करोगे रैग सिस्टम्स बनाओगे स्क्रैच से एंड एक रैक सिस्टम बनाने के ना बहुत सारी टेक्निक्स हैं एंड रोज़ 
चेंज होती हैं हाउ टू एफिशिएंटली बिल्ड अ रैक सिस्टम दैट शुड बी दी अ गोल हियर ठीक है तो इसमें फिर आपको क्रोमा डीबी पाइनको डीबी इस 
तरह के वेक्टर स्टोर्स दिखेंगे आपको कोसाइन सिमिलरिटी चंकिंग एंड इंडेक्सिंग के बारे में पता लगेगा फिर आप क्या कर सकते हो एक रेज़ोमे 
एनालाइजर बॉर्ड बना सकते हो तो यहां पर प्र्प्टिंग राइट अ वेक्टर मैनेजमेंट उसके बाद आप ग्राफ डीवी भी यहां पर इंजेस्ट कर सकते हो कि 
आप एक नॉलेज ग्राफ बना सकते हो एंड उसके बाद आप क्या कर सकते हो आप बेसिकली एक चैट बॉट बना सकते हो एक रे्यूमे के ऊपर एंड यहां पर वो 
सारी टेक्नोलॉजीस कंबाइन होनी शुरू हो जाएंगी जो भी आपने अभी तक सीखी उसके बाद आप एक YouTube वीडियो क्यूएनए बॉट बना सकते हो आप क्या 
कर सकते हो आप YouTube का एक लिंक दो एंड उस वीडियो के ऊपर अब आप चैट कर सकते हो एंड ट्रस्ट मी दिस इज़ अ वेरी सिंपल प्रोजेक्ट लेकिन 
क्या प्रॉब्लम है इनको स्केल करना मुश्किल है देखो वही मैंने यहां बार बताया ना जब हम ये डायग्राम बना रहे थे देखो एलएलएम बनाना अपने 
आप में एक साइंस है लेकिन उसको आपके सिस्टम के साथ इंजेस्ट करना और उसको स्केलेबल मैनर में यूज़ करना इज़ अ डिफरेंट आर्ट ठीक है तो हम 
यहां पर ना इस इस वाले आर्ट की बात कर रहे हैं सो दिस इज़ वेरीेंट ओके फिर जैसे ही आप अपने सिस्टम्स में उसको इंटीग्रेट करना शुरू करते 
हो विद माइक्रो सर्विसेस वहां पर आपको टूलिंग की प्रॉब्लम आती है देन यू नीड टूलिंग तो आपको पता लगेगा एक रिएक्ट एजेंट क्या होता है यह 
वो वाला रिएक्ट नहीं है दिस इज़ लाइक रिएक्ट ओके ठीक है टूल्स कैसे आप बाइंड कर सकते हो आपके एलएलएम्स के साथ फिर आप कुछ टूल्स देखोगे 
जो ऑलरेडी है लाइक सर्प एपीआई कैलकुलेटर टूल वेब सर्च टूल डॉक सीड टूल वेबस्कपिंग वगैरह के टूल्स हैं एंड वेदर टूल्स हैं तो आप खुद के 
टूल्स बना के आप उनके साथ भी प्ले अराउंड कर सकते हो फिर आप क्या कर सकते हो एक एआई ट्रैवल प्लानर बना सकते हो जिसमें आप एक्सटर्नल 
एपीआई को बेसिकली यूज़ करते हो एलएलएम एनएलपी के साथ जिसमें आपका एक नेक्स्ट लेवल रैक सिस्टम बन जाता है सो दिस इज़ बेसिकली योर रैक ओके 
फिर उसके बाद और बड़े सिस्टम्स के लिए आपके पास क्या आता लैंग्राफ फॉर ऑर्केस्ट्रेशन एंड मल्टी एजेंट सिस्टम देखो हर एजेंट की एजेंट 
लाइक फॉर एग्जांपल आपके पास एक ओपन एआई एजेंट है राइट आपके पास एक क्लॉड का एजेंट है आपके पास एक लेट्स से एक जेमिनाई है हर एक एलएलएम 
मॉडल की ना अपनी-अपनी कैपेबिलिटीज़ होती हैं कोई कोडिंग में अच्छा है कोई मैथ्स में अच्छा है कोई रीजनिंग में अच्छा है तो कोई कॉस्ट 
एफिशिएंट है तो आपको क्या करना पड़ता है जब भी आपका एक फ्लो होता है आप एक ग्राफ बेस्ड रीजनिंग कर सकते हो मतलब आप एक बहुत ही 
कॉम्प्लेक्स ग्राफ बना सकते हो कि यार ये टास्क पहले ये मॉडल करेगा फिर ये करेगा फिर ये करेगा फिर वो हैंड ऑफ करेगा टास्क को यहां से 
वहां तो वो सारी जो ऑर्केस्टेशन है वो आप प्लान ग्राफ से कर सकते हो एंड यू कैन एक्चुअली बिल्ड अ मल्टी मॉडल एंड मल्टी एजेंट ग्राफ ओके 
तो यहां पर दिस इज़ वेरीेंट फिर इनको ट्रैक डाउन कैसे करते हैं वो यहां पे मैंने मेंशन नहीं करा कि जब आप एक लैंग ग्राफ लैंग चेन और इन 
सब चीजों को कंबाइन करना स्टार्ट करते हो ना मॉनिटरिंग अपने आप में एक सब्जेक्ट बन जाता है कि इनको मॉनिटरिंग डीबगिंग कैसे करेंगे राइट 
इनको को हम मॉनिटर कैसे करेंगे कि कौन सी ग्राफ ने क्या आउटपुट दिया क्या इनपुट था क्या सब कुछ सही से चल रहा है या नहीं तो 
ऑब्जरवेबिलिटी एंड मॉनिटरिंग इज़ अ टॉपिक हियर ओके फिर अगर हम आगे बढ़ते हैं हमारे पास यहां पे डिप्लॉयमेंट्स आती हैं कि यार एक बात बताओ 
आपने पूरा सिस्टम बना तो लिया अब इसको कोई एक्सपोज़ भी तो करना है ना फ्रंट एंड को इसके टॉप पे एक फास्ट एपीआई जैसा एक सर्वर यूज़ करके 
इसके एंड पॉइंट्स को एक्सपोज़ करो करेक्ट इसको स्केलेबल बनाओ इसको डॉकराइज़ करो फिर फ्रंट एंड में इसको यूज़ करो तो वो सब चीजें भी यहां 
पर आती हैं तो एपीआई डेप्लॉयमेंट एंड वेब एप इंटीग्रेशन ठीक है कि एपीआई राउटिंग ऑथ जेसन इनपुट आउटपुट्स एंड उसके बाद आप यहां पर क्या 
बिल्ड कर सकते हो एक एआई कोड रिव्य्यू है आप बना सकते हो कि अगर आपने एक पुल रिक्वेस्ट ओपन किया तो वो उसको रिव्य्यू कर दे नाइस ठीक है 
तो ये सब चीजें आ गई राइट उसके बाद एमसीपी पे आते हैं दैट इज़ मॉडल कॉन्टेक्स्ट प्रोटोकॉल अब यहां पे आप कहोगे यार ये मॉडल कस्टमाइजेशन 
एंड पर्सनलाइज़ेशन क्यों लिखा है देखो मॉडल कॉन्टेक्स्ट प्रोटोकॉल करता तो काइंड ऑफ़ यही है ना एक काम करते हैं इसको मैं समझाता हूं मॉडल 

कॉन्टेक्स्ट प्रोटोकॉल वैसे तो हमने इस इस पर्टिकुलर चैनल पे बहुत बार वीडियोज़ बना ही रखी हैं देखो एमसीपी क्या करता है ना एमसीपी 
क्लॉड लेकर आया था क्लॉड एंथ्रोफिक द कंपनी जो एंथ्रोफिक है एमसीपी होता है कि आप अपने एलएलएम को कॉन्टेक्स्ट कैसे प्रोवाइड करते हो 
देखो अभी तक हम क्या कर रहे हैं हम यहां पे जितने भी एप्लीकेशनेशंस बनाएंगे ना इसके अंदर आप क्या करोगे ना वेरियस टेक्निक्स यूज़ कर रहे 
होगे कि कैसे मैं फीड कर सकता हूं कॉन्टेक्स्ट को राइट मैं कॉन्टेक्स्ट कैसे फीड कर सकता हूं लेकिन यहां पर होगा क्या आप ना बहुत ही 
अलग-अलग तरीके से कर रहेगे आप हो सकता है सिस्टम फ्रॉम में इंजेक्ट कर रहे हो राइट आप हो सकता है यूजर में दे रहे हो आप हो सकता है कि 
एज अ स्ट्रिंग फॉर्मेट में दे रहे हो या फिर आप जेएस फॉर्मेट में दे रहे हो तो व्हाट यू विल नोटिस इज़ ना कि ये कोई स्टैंडर्ड वे नहीं 
है कोई भी एक स्टैंडर्ड वे नहीं है कि एक कॉन्टेक्स्ट को एक मॉडल को कैसे दिया जाए करेक्ट तो उस पर्टिकुलर सिनेरियो में हम एमसीबी को 
इंट्रोड्यूस करते हैं कि हम क्या करेंगे हम अपने टूल्स को बनाएंगे हम अपने टूल्स को एक स्टैंडर्ड फॉर्मेट के अंदर होस्ट करेंगे एंड 
हमारा एलएलएम उन टूल्स को कैसे डिस्कवर करेगा डिस्कवरी इज़ द नंबर वन थिंग सेकंडली उसके उन टूल्स को कैसे कॉल करेगा एंड वहां से 
कॉन्टेक्स्ट को कैसे रिट्रीव करेगा उसका एक स्टैंडर्डाइज़ेशन वे हम एमसीपी के अंदर देखेंगे तो हम खुद के एमसीपी सर्वर्स बनाएंगे हम खुद 
के एमसीपी क्लाइंट्स यहां पर बनाते हैं एंड देन वी नोटिस कि ठीक है इस तरह से हम एक स्टैंडर्डाइज़्ड कॉन्टेक्स्ट प्रोटोकॉल बना सकते हैं 
एंड वो प्रोटोकॉल जो है वो सिर्फ क्लॉड यूज़ नहीं करेगा वो क्लॉड के मॉडल्स भी यूज़ करेंगे वो जेमिनाई में भी इंजस्ट हो सकते हैं वो आपके 
कर्सर लाइक आईडीज के अंदर भी इंजस्ट हो सकते हैं वो आपके ओपन एआई के अंदर भी इंजस्ट हो सकते हैं तो एमसीपी इज़ रियली नाइस ओके फिर उसके 
बाद आपका एक डिप्लॉयमेंट आता है कि रेट लिमिटिंग इसके ऊपर लगा हो कैशिंग लगा हो राइट प्र्प्ट कैशिंग क्या होता है रिस्पांस कैशिंग रेट 
लिमिटिंग लॉगिंग तो वो सब चीज़ आपके यहां पे आएंगी ट्रेिंग विद लैंथ एंड ओपन टेलीमेंट्री तो वो जो मैंने बात की थी ट्रेिंग एंड ऑल वो सब 
चीजें फिर आप क्या कर सकते हो आप यहां पे फुल स्टक प्रोजेक्ट्स बना सकते हो लाइक एआई फीडबैक प्रोजेक्ट्स राइट एंड उसके बाद आप यहां पे 
डेटा डैशबोर्ड व्यू रैंकिंग स्कोर्स व्यू ये सब चीजें आप बना सकते हो तो बहुत सारे प्रोजेक्ट्स बन सकते हैं मतलब प्रोजेक्ट्स की तो कोई 
लिमिट नहीं है ओके फिर बोनस के अंदर आप देख सकते हो कि फाइन ट्यूनिंग वर्सेस रैग कि कब फाइन ट्यूनिंग यूज़ करना चाहिए कब रैक सिस्टम यूज़ 
करना चाहिए आप ओपन सोर्स एलएलएस को कैसे रन कर सकते हो फॉर एग्जांपल मेटा का लामा मॉडल मिस्ट्रोल मॉडल ओ लामा को यूज़ करके आप कैसे ओपन 
सोर्स मॉडल्स को आपके ही मशीन में रन कर सकते हो ठीक है फिर लोकल वेक्टर डीबीज़ एंबेडिंग मॉडल्स आप देख सकते हो तो यहां पे क्या होगा 
जैसे हम इस पॉइंट पे पहुंचेंगे ना हगिंग फेस का जोेंस है वो आपको समझ में आना स्टार्ट हो जाएगा ठीक है कि भाई हग हगिंग फेस 
ट्रांसफार्मर्स को यूज़ करके हम कैसे टोकनाइजेशन करते हैं हम कैसे मॉडल्स को यूज़ करते हैं एंड हम उनको कैसे डीटोकनाइज़ करते हैं तो वो 
थोड़ा सा और एडवांस यूज़ केसेस आ जाते हैं जहां पर आपको ओपन सोर्स मॉडल्स को यूज़ करना है ओके एंड फाइंड ट्यून करना है ऑफ़ कोर्स फिर उसके 
बाद कॉस्ट ऑप्टिमाइजेशन टेक्निक फॉर एग्जांपल टोकन काउंटिंग टोकन स्ट्रीमिंग एंड उसके बाद आप टोकन कै प्र्प कैशिंग तो वो सब चीजें यहां 
पर आती हैं तो जब आप ये सब चीजें सीख लेते हो ना इट्स अ वेरी बिगिनर थिंग टू बी ऑनेस्ट जब आप ये सब चीजें सीख लेते हो ना आपका पैराडाइम 

शिफ्ट स्टार्ट हो जाता है ठीक है बिकॉज़ एआई के साथ काम करना ना इट्स अ लिटिल बिट ऑफ़ पैराडाइम रीज़न क्या है ना यहां पर ना आउटपुट 
अनएक्सेक्टेड होती है राइट व्हाट यू गिवेन व्हाट यू गेट आउट यहां पर कोई भी गारंटी नहीं है देखो डेटाबेस में क्या होता है जब हम 

डेटाबेस के साथ काम करते हैं वी हैव अ गारंटी मैंने एक एसक्यूएल स्टेटमेंट लिखा एंड आई कैन वेरी वेल प्रिडिक्ट इसका आउटपुट क्या होगा 
एनएलपी ओपन एआई एलएलएम्स इन केसेस में ऐसा नहीं होता है यू हैव टू बेसिकली सी दैट कैसे इनपुट के लिए कैसा आउटपुट आ रहा है बहुत सारी 
एक्सपेरिमेंटिंग होती है बहुत सारी ऑर्केस्टेशंस होती हैं और उसके बाद जाकर एक स्केलेबल अच्छा एक एआई बेस्ड सॉफ्टवेयर बनता है तो ये सब 
चीजों को मास्टर करने के लिए ना आपका एक पैराडाइम शिफ्ट होता है आपका ब्रेन शिफ्ट करता है डेवलपर माइंडसेट से थोड़ा सा चेंज होता है 
ठीक है बिकॉज़ यहां पर जो फ्लो होता है ना वो थोड़ा सा ऑटोनॉमस होता है ओके सो दिस इज़ समथिंग वी विल अंडरस्टैंड कि ऑटोनॉमस वर्क फ्लोस 
क्या होते हैं एंड कंट्रोलोल्ड वर्क फ्लोस क्या होते हैं एआई एनवायरमेंट्स के अंदर सो दिस इज़ बेसिकली अ काइंड ऑफ़ एन ओवरव्यू और अ रोड 
मैप कि आपको क्या करना चाहिए इफ यू वांट टू बिकम अ जेन एआई डेवलपर इन 2025 एंड बाय द वे जस्ट एन हेड्स अप हम अपना एक बहुत ही मिनी 
कोहोट लेकर आ रहे हैं दैट इज़ ऑन जेन एआई फॉर डेवलपर्स जिसके अंदर हम ये सारी चीजें कवर करने वाले हैं एंड ट्रस्ट मी दीज़ थिंग्स आर वेरी 
इजी लेकिन दी प्रॉब्लम इज़ कि इनके लिए आपको एक गाइड चाहिए ओके ये सब चीजों को एक बार देखने के लिए करने के लिए यू नीड अ गाइड तो ये सब 
चीजें हम अपने उस कोहोड के अंदर कवर करेंगे व्हिच इज़ स्टार्टिंग ऑन सेवंथ अप्रैल जस्ट इन केस यू आर इंटरेस्टेड मैं उसका लिंक आपको 
डिस्क्रिप्शन में दे दूंगा ओके सो डू चेक आउट दैट कोहड उसका लिंक आपको मिल जाएगा बट आई होप दैट एक क्लेरिटी मिला दैट व्हाट ऑल यू शुड लर्न इन 2025 अगर आपको फुल स्टक डेवलपमेंट ऑलरेडी आता है ओके एंड यस वन मोर थिंग ये पर्टिकुलर जेएनए रोड मैप आप तभी फॉलो करना अगर आप ऑलरेडी एक फुल स्टक डेवलपर हो मतलब कि आपको बैक एंड भी आता है आपको फ्रंट एंड भी आता है एंड आप डेटाबेसिस को यूज़ करके क्रड ऑपरेशन कर 
सकते हो अगर आप ये तीन चीजें कर सकते हो देन यू आर मोस्ट वेलकम टू होप इंटू द जेन एआई वर्ल्ड अगर आपको अभी ये फाउंडेशन तीन चीजें नहीं 
आती हैं आई वुड से अभी आप जेन एआई में मत आना बिकॉज़ फिर क्या होगा थोड़ा सा क्यटिक हो जाएगा सो दैट वाज़ ऑल अबाउट दिस पर्टिकुलर वीडियो 
आई होप आपको थोड़ा सा एक आईडिया लगा होगा कि जेन एआई रोड मैप कैसा दिखता है व्हाट ऑल थिंग्स यू कैन लर्न एंड जस्ट इन केस अगर आप कुछ ऐड 
करना चाहते हैं रोड मैप के अंदर फील फ्री टू ऐड थिंग्स इन द कमेंट सेक्शन बिकॉज़ ये फील्ड बहुत डायनामिक है हर रोज बहुत सारी न्यू चीजें 
आती हैं बहुत सारी न्यू टर्मिनोलॉजिसज़ आती हैं बहुत सारी न्यू लाइब्रेरीज़ आती हैं तो दिस इज़ काइंड ऑफ़ एन एक्सपेंडिंग रोड मैप ठीक है ये 
रोड मैप एक्सपैंड होता ही जाएगा अगर मैं सेम रोड मैप मे बी 2 मंथ्स के बाद बनाऊंगा तो देयर विल बी अ लॉट ऑफ़ न्यू थिंग्स इन दिस रोड मैप 
ठीक है तो जैसे ही आप कोई नई चीजें डिस्कवर करते हैं आप कमेंट्स में डाल सकते हैं एंड बाकी जो इस पर्टिकुलर वीडियो के व्यूअर्स हैं वो 
कमेंट्स में से और रिसोर्सेज को भी पिक अप कर सकते हैं सो दैट वाज़ ऑल अबाउट दिस पर्टिकुलर वीडियो मिलते हैं हम आपको नेक्स्ट वीडियो के अंदर 
`;